In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

In [4]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
list(df.columns.values)

['experience',
 'test_score(out of 10)',
 'interview_score(out of 10)',
 'salary($)']

In [14]:
df.rename(columns = ({'test_score(out of 10)' : 'score', 'interview_score(out of 10)' : 'interview_score', 'salary($)' : 'salary'}), inplace = True)

In [15]:
list(df.columns.values)

['experience', 'score', 'interview_score', 'salary']

In [16]:
df

  experience  score  interview_score  salary
0        NaN    8.0                9   50000
1        NaN    8.0                6   45000
2       five    6.0                7   60000
3        two   10.0               10   65000
4      seven    9.0                6   70000
5      three    7.0               10   62000
6        ten    NaN                7   72000
7     eleven    7.0                8   80000

In [20]:
df.experience = df.experience.fillna('zero')

In [21]:
df

  experience  score  interview_score  salary
0       zero    8.0                9   50000
1       zero    8.0                6   45000
2       five    6.0                7   60000
3        two   10.0               10   65000
4      seven    9.0                6   70000
5      three    7.0               10   62000
6        ten    NaN                7   72000
7     eleven    7.0                8   80000

In [22]:
median_interview = df.interview_score.median()

In [23]:
df.interview_score = df.interview_score.fillna(median_interview)

In [24]:
df

  experience  score  interview_score  salary
0       zero    8.0                9   50000
1       zero    8.0                6   45000
2       five    6.0                7   60000
3        two   10.0               10   65000
4      seven    9.0                6   70000
5      three    7.0               10   62000
6        ten    NaN                7   72000
7     eleven    7.0                8   80000

In [25]:
from word2number import w2n

In [40]:
for i in range(0, len(df.experience)):
    df.experience[i] = w2n.word_to_num(df.experience[i])
df

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [41]:
df

  experience  score  interview_score  salary
0          0    8.0                9   50000
1          0    8.0                6   45000
2          5    6.0                7   60000
3          2   10.0               10   65000
4          7    9.0                6   70000
5          3    7.0               10   62000
6         10    NaN                7   72000
7         11    7.0                8   80000

In [42]:
median_score = df.score.median()

In [43]:
df.score = df.score.fillna(median_score)

In [44]:
df

  experience  score  interview_score  salary
0          0    8.0                9   50000
1          0    8.0                6   45000
2          5    6.0                7   60000
3          2   10.0               10   65000
4          7    9.0                6   70000
5          3    7.0               10   62000
6         10    8.0                7   72000
7         11    7.0                8   80000

In [45]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience', 'score', 'interview_score']], df.salary)

LinearRegression()

In [46]:
reg.predict([[2,9,6]])

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])